dcellucci/CSL-Part-Library/Arduino/hardware/ATSAMD-Boards/samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cpu=Processor
menu.com=Communications
menu.clock=Clock Source

# MattairTech MT-D21E (default 8KB bootloader)
csl_d21e_bl8k.name=CSL ATSAMD21E (SAM-BA bootloader)
csl_d21e_bl8k.vid.0=0x16D0
csl_d21e_bl8k.pid.0=0x0557
csl_d21e_bl8k.vid.1=0x16D0
csl_d21e_bl8k.pid.1=0x0856
csl_d21e_bl8k.upload.tool=MattairTech_Arduino:bossac
# csl_d21e_bl8k.upload.tool=arduino:bossac
csl_d21e_bl8k.upload.protocol=sam-ba
csl_d21e_bl8k.upload.use_1200bps_touch=true
csl_d21e_bl8k.upload.wait_for_upload_port=true
csl_d21e_bl8k.upload.native_usb=true
csl_d21e_bl8k.menu.cpu.samd21e18a=SAMD21E18A
csl_d21e_bl8k.menu.cpu.samd21e18a.upload.maximum_size=253952
csl_d21e_bl8k.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
csl_d21e_bl8k.menu.cpu.samd21e18a.build.ldscript=linker_scripts/gcc/flash_256KB_with_8KB_bootloader.ld
csl_d21e_bl8k.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
csl_d21e_bl8k.menu.cpu.samd21e17a=SAMD21E17A
csl_d21e_bl8k.menu.cpu.samd21e17a.upload.maximum_size=122880
csl_d21e_bl8k.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
csl_d21e_bl8k.menu.cpu.samd21e17a.build.ldscript=linker_scripts/gcc/flash_128KB_with_8KB_bootloader.ld
csl_d21e_bl8k.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
csl_d21e_bl8k.menu.cpu.samd21e16a=SAMD21E16A
csl_d21e_bl8k.menu.cpu.samd21e16a.upload.maximum_size=57344
csl_d21e_bl8k.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
csl_d21e_bl8k.menu.cpu.samd21e16a.build.ldscript=linker_scripts/gcc/flash_64KB_with_8KB_bootloader.ld
csl_d21e_bl8k.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
csl_d21e_bl8k.menu.cpu.samd21e15a=SAMD21E15A
csl_d21e_bl8k.menu.cpu.samd21e15a.upload.maximum_size=24576
csl_d21e_bl8k.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ -D__8KB_BOOTLOADER__ {build.usb_flags}
csl_d21e_bl8k.menu.cpu.samd21e15a.build.ldscript=linker_scripts/gcc/flash_32KB_with_8KB_bootloader.ld
csl_d21e_bl8k.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
csl_d21e_bl8k.build.mcu=cortex-m0plus
csl_d21e_bl8k.build.f_cpu=48000000L
csl_d21e_bl8k.build.usb_product="MT-D21E"
csl_d21e_bl8k.build.usb_manufacturer="MattairTech"
csl_d21e_bl8k.build.board=CDC_UART
csl_d21e_bl8k.menu.com.cdc_uart=CDC_UART
csl_d21e_bl8k.menu.com.cdc_uart.build.board=CDC_UART
csl_d21e_bl8k.menu.com.cdc_uart.build.pid=0x0557
csl_d21e_bl8k.menu.com.cdc_hid_uart=CDC_HID_UART
csl_d21e_bl8k.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
csl_d21e_bl8k.menu.com.cdc_hid_uart.build.pid=0x0856
csl_d21e_bl8k.menu.com.cdc_hid=CDC_HID
csl_d21e_bl8k.menu.com.cdc_hid.build.board=CDC_HID
csl_d21e_bl8k.menu.com.cdc_hid.build.pid=0x0856
csl_d21e_bl8k.menu.com.cdc=CDC_ONLY
csl_d21e_bl8k.menu.com.cdc.build.board=CDC_ONLY
csl_d21e_bl8k.menu.com.cdc.build.pid=0x0557
csl_d21e_bl8k.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
csl_d21e_bl8k.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
csl_d21e_bl8k.menu.com.cdc_midi_hid_uart.build.pid=0x0B34
# csl_d21e_bl8k.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# csl_d21e_bl8k.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# csl_d21e_bl8k.menu.com.cdc_msd_hid_uart.build.pid=0x0B40
# csl_d21e_bl8k.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# csl_d21e_bl8k.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# csl_d21e_bl8k.menu.com.cdc_msd_midi_hid_uart.build.pid=0x0B41
# csl_d21e_bl8k.menu.com.msd_uart=MSD_UART
# csl_d21e_bl8k.menu.com.msd_uart.build.board=MSD_UART
# csl_d21e_bl8k.menu.com.msd_uart.build.pid=0x0A0C
csl_d21e_bl8k.menu.com.uart=UART_ONLY
csl_d21e_bl8k.menu.com.uart.build.board=UART_ONLY
csl_d21e_bl8k.menu.com.uart.build.pid=0x0856
csl_d21e_bl8k.menu.com.none=USB_UART_DISABLED
csl_d21e_bl8k.menu.com.none.build.board=USB_UART_DISABLED
csl_d21e_bl8k.menu.com.none.build.pid=0x0856

csl_d21e_bl8k.menu.clock.noclock= Internal
csl_d21e_bl8k.menu.clock.noclock.build.clock=CRYSTALLESS
csl_d21e_bl8k.menu.clock.32kosc= External 32.768k
csl_d21e_bl8k.menu.clock.32kosc.build.clock=EXT32KOSC

csl_d21e_bl8k.build.core=arduino
csl_d21e_bl8k.build.variant=MT_D21E
csl_d21e_bl8k.build.variant_system_lib=
csl_d21e_bl8k.build.vid=0x16D0
csl_d21e_bl8k.bootloader.tool=arduino:openocd
csl_d21e_bl8k.menu.cpu.samd21e18a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E18A.bin
csl_d21e_bl8k.menu.cpu.samd21e17a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E17A.bin
csl_d21e_bl8k.menu.cpu.samd21e16a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E16A.bin
csl_d21e_bl8k.menu.cpu.samd21e15a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E15A.bin


# MattairTech MT-D21E (16KB bootloader), build only
#mattairtech_mt_d21e_bl16k.name=MattairTech MT-D21E (MSD bootloader)
#mattairtech_mt_d21e_bl16k.vid.0=0x16D0
#mattairtech_mt_d21e_bl16k.pid.0=0x0557
#mattairtech_mt_d21e_bl16k.vid.1=0x16D0
#mattairtech_mt_d21e_bl16k.pid.1=0x0856
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e18a=SAMD21E18A
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e18a.upload.maximum_size=245760
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ -D__16KB_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e18a.build.ldscript=linker_scripts/gcc/flash_256KB_with_16KB_bootloader.ld
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e17a=SAMD21E17A
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e17a.upload.maximum_size=114688
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ -D__16KB_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e17a.build.ldscript=linker_scripts/gcc/flash_128KB_with_16KB_bootloader.ld
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e16a=SAMD21E16A
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e16a.upload.maximum_size=49152
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ -D__16KB_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e16a.build.ldscript=linker_scripts/gcc/flash_64KB_with_16KB_bootloader.ld
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e15a=SAMD21E15A
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e15a.upload.maximum_size=16384
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ -D__16KB_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl16k.menu.cpu.samd21e15a.build.ldscript=linker_scripts/gcc/flash_32KB_with_16KB_bootloader.ld
#mattairtech_mt_d21e_bl16k.build.mcu=cortex-m0plus
#mattairtech_mt_d21e_bl16k.build.f_cpu=48000000L
#mattairtech_mt_d21e_bl16k.build.usb_product="MT-D21E"
#mattairtech_mt_d21e_bl16k.build.usb_manufacturer="MattairTech"
#mattairtech_mt_d21e_bl16k.build.board=CDC_UART
#mattairtech_mt_d21e_bl16k.menu.com.cdc_uart=CDC_UART
#mattairtech_mt_d21e_bl16k.menu.com.cdc_uart.build.board=CDC_UART
#mattairtech_mt_d21e_bl16k.menu.com.cdc_uart.build.pid=0x0557
#mattairtech_mt_d21e_bl16k.menu.com.cdc_hid_uart=CDC_HID_UART
#mattairtech_mt_d21e_bl16k.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
#mattairtech_mt_d21e_bl16k.menu.com.cdc_hid_uart.build.pid=0x0856
#mattairtech_mt_d21e_bl16k.menu.com.cdc_hid=CDC_HID
#mattairtech_mt_d21e_bl16k.menu.com.cdc_hid.build.board=CDC_HID
#mattairtech_mt_d21e_bl16k.menu.com.cdc_hid.build.pid=0x0856
#mattairtech_mt_d21e_bl16k.menu.com.cdc=CDC_ONLY
#mattairtech_mt_d21e_bl16k.menu.com.cdc.build.board=CDC_ONLY
#mattairtech_mt_d21e_bl16k.menu.com.cdc.build.pid=0x0557
#mattairtech_mt_d21e_bl16k.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
#mattairtech_mt_d21e_bl16k.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
#mattairtech_mt_d21e_bl16k.menu.com.cdc_midi_hid_uart.build.pid=0x0B34
# mattairtech_mt_d21e_bl16k.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# mattairtech_mt_d21e_bl16k.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# mattairtech_mt_d21e_bl16k.menu.com.cdc_msd_hid_uart.build.pid=0x0B40
# mattairtech_mt_d21e_bl16k.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d21e_bl16k.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d21e_bl16k.menu.com.cdc_msd_midi_hid_uart.build.pid=0x0B41
# mattairtech_mt_d21e_bl16k.menu.com.msd_uart=MSD_UART
# mattairtech_mt_d21e_bl16k.menu.com.msd_uart.build.board=MSD_UART
# mattairtech_mt_d21e_bl16k.menu.com.msd_uart.build.pid=0x0A0C
#mattairtech_mt_d21e_bl16k.menu.com.uart=UART_ONLY
#mattairtech_mt_d21e_bl16k.menu.com.uart.build.board=UART_ONLY
#mattairtech_mt_d21e_bl16k.menu.com.uart.build.pid=0x0856
#mattairtech_mt_d21e_bl16k.menu.com.none=USB_UART_DISABLED
#mattairtech_mt_d21e_bl16k.menu.com.none.build.board=USB_UART_DISABLED
#mattairtech_mt_d21e_bl16k.menu.com.none.build.pid=0x0856
#mattairtech_mt_d21e_bl16k.build.core=arduino
#mattairtech_mt_d21e_bl16k.build.variant=MT_D21E
#mattairtech_mt_d21e_bl16k.build.variant_system_lib=
#mattairtech_mt_d21e_bl16k.build.vid=0x16D0
#mattairtech_mt_d21e_bl16k.build.pid=0x0856


# MattairTech MT-D21E (no bootloader)
#mattairtech_mt_d21e_bl0k.name=MattairTech MT-D21E (no bootloader)
#mattairtech_mt_d21e_bl0k.vid.0=0x16D0
#mattairtech_mt_d21e_bl0k.pid.0=0x0557
#mattairtech_mt_d21e_bl0k.vid.1=0x16D0
#mattairtech_mt_d21e_bl0k.pid.1=0x0856
#mattairtech_mt_d21e_bl0k.upload.tool=arduino:openocd
#mattairtech_mt_d21e_bl0k.upload.protocol=sam-ba
#mattairtech_mt_d21e_bl0k.upload.use_1200bps_touch=false
#mattairtech_mt_d21e_bl0k.upload.wait_for_upload_port=false
#mattairtech_mt_d21e_bl0k.upload.native_usb=false
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e18a=SAMD21E18A
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e18a.upload.maximum_size=262144
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ -D__NO_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e18a.build.ldscript=linker_scripts/gcc/flash_256KB_without_bootloader.ld
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e17a=SAMD21E17A
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e17a.upload.maximum_size=131072
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ -D__NO_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e17a.build.ldscript=linker_scripts/gcc/flash_128KB_without_bootloader.ld
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e16a=SAMD21E16A
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e16a.upload.maximum_size=65536
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ -D__NO_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e16a.build.ldscript=linker_scripts/gcc/flash_64KB_without_bootloader.ld
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e15a=SAMD21E15A
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e15a.upload.maximum_size=32768
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ -D__NO_BOOTLOADER__ {build.usb_flags}
#mattairtech_mt_d21e_bl0k.menu.cpu.samd21e15a.build.ldscript=linker_scripts/gcc/flash_32KB_without_bootloader.ld
#mattairtech_mt_d21e_bl0k.build.mcu=cortex-m0plus
#mattairtech_mt_d21e_bl0k.build.f_cpu=48000000L
#mattairtech_mt_d21e_bl0k.build.usb_product="MT-D21E"
#mattairtech_mt_d21e_bl0k.build.usb_manufacturer="MattairTech"
#mattairtech_mt_d21e_bl0k.build.board=CDC_UART
#mattairtech_mt_d21e_bl0k.menu.com.cdc_uart=CDC_UART
#mattairtech_mt_d21e_bl0k.menu.com.cdc_uart.build.board=CDC_UART
#mattairtech_mt_d21e_bl0k.menu.com.cdc_uart.build.pid=0x0557
#mattairtech_mt_d21e_bl0k.menu.com.cdc_hid_uart=CDC_HID_UART
#mattairtech_mt_d21e_bl0k.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
#mattairtech_mt_d21e_bl0k.menu.com.cdc_hid_uart.build.pid=0x0856
#mattairtech_mt_d21e_bl0k.menu.com.cdc_hid=CDC_HID
#mattairtech_mt_d21e_bl0k.menu.com.cdc_hid.build.board=CDC_HID
#mattairtech_mt_d21e_bl0k.menu.com.cdc_hid.build.pid=0x0856
#mattairtech_mt_d21e_bl0k.menu.com.cdc=CDC_ONLY
#mattairtech_mt_d21e_bl0k.menu.com.cdc.build.board=CDC_ONLY
#mattairtech_mt_d21e_bl0k.menu.com.cdc.build.pid=0x0557
#mattairtech_mt_d21e_bl0k.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
#mattairtech_mt_d21e_bl0k.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
#mattairtech_mt_d21e_bl0k.menu.com.cdc_midi_hid_uart.build.pid=0x0B34
# mattairtech_mt_d21e_bl0k.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# mattairtech_mt_d21e_bl0k.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# mattairtech_mt_d21e_bl0k.menu.com.cdc_msd_hid_uart.build.pid=0x0B40
# mattairtech_mt_d21e_bl0k.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d21e_bl0k.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d21e_bl0k.menu.com.cdc_msd_midi_hid_uart.build.pid=0x0B41
# mattairtech_mt_d21e_bl0k.menu.com.msd_uart=MSD_UART
# mattairtech_mt_d21e_bl0k.menu.com.msd_uart.build.board=MSD_UART
# mattairtech_mt_d21e_bl0k.menu.com.msd_uart.build.pid=0x0A0C
#mattairtech_mt_d21e_bl0k.menu.com.uart=UART_ONLY
#mattairtech_mt_d21e_bl0k.menu.com.uart.build.board=UART_ONLY
#mattairtech_mt_d21e_bl0k.menu.com.uart.build.pid=0x0856
#mattairtech_mt_d21e_bl0k.menu.com.none=USB_UART_DISABLED
#mattairtech_mt_d21e_bl0k.menu.com.none.build.board=USB_UART_DISABLED
#mattairtech_mt_d21e_bl0k.menu.com.none.build.pid=0x0856
#mattairtech_mt_d21e_bl0k.build.core=arduino
#mattairtech_mt_d21e_bl0k.build.variant=MT_D21E
#mattairtech_mt_d21e_bl0k.build.variant_system_lib=
#mattairtech_mt_d21e_bl0k.build.vid=0x16D0
#mattairtech_mt_d21e_bl0k.build.pid=0x0856



# MattairTech MT-D11 (4KB bootloader)
mattairtech_mt_d11.name=MattairTech MT-D11 (SAM-BA bootloader)
mattairtech_mt_d11.vid.0=0x16D0
mattairtech_mt_d11.pid.0=0x0557
mattairtech_mt_d11.vid.1=0x16D0
mattairtech_mt_d11.pid.1=0x0856
mattairtech_mt_d11.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d11.upload.protocol=sam-ba
mattairtech_mt_d11.upload.use_1200bps_touch=true
mattairtech_mt_d11.upload.wait_for_upload_port=true
mattairtech_mt_d11.upload.native_usb=true
mattairtech_mt_d11.upload.maximum_size=12288
mattairtech_mt_d11.build.extra_flags=-D__SAMD11D14AM__ -D__4KB_BOOTLOADER__ {build.usb_flags}
mattairtech_mt_d11.build.ldscript=linker_scripts/gcc/SAMD11D14AM_with_4KB_bootloader.ld
mattairtech_mt_d11.build.openocdscript=openocd_scripts/SAMD11D14AM.cfg
mattairtech_mt_d11.build.mcu=cortex-m0plus
mattairtech_mt_d11.build.f_cpu=48000000L
mattairtech_mt_d11.build.usb_product="MT-D11"
mattairtech_mt_d11.build.usb_manufacturer="MattairTech"
mattairtech_mt_d11.build.board=CDC_UART
mattairtech_mt_d11.menu.com.cdc_uart=CDC_UART
mattairtech_mt_d11.menu.com.cdc_uart.build.board=CDC_UART
mattairtech_mt_d11.menu.com.cdc_uart.build.pid=0x0557
mattairtech_mt_d11.menu.com.cdc_hid_uart=CDC_HID_UART
mattairtech_mt_d11.menu.com.cdc_hid_uart.build.board=CDC_HID_UART
mattairtech_mt_d11.menu.com.cdc_hid_uart.build.pid=0x0856
mattairtech_mt_d11.menu.com.cdc_hid=CDC_HID
mattairtech_mt_d11.menu.com.cdc_hid.build.board=CDC_HID
mattairtech_mt_d11.menu.com.cdc_hid.build.pid=0x0856
mattairtech_mt_d11.menu.com.cdc=CDC_ONLY
mattairtech_mt_d11.menu.com.cdc.build.board=CDC_ONLY
mattairtech_mt_d11.menu.com.cdc.build.pid=0x0557
mattairtech_mt_d11.menu.com.cdc_midi_hid_uart=CDC_MIDI_HID_UART
mattairtech_mt_d11.menu.com.cdc_midi_hid_uart.build.board=CDC_MIDI_HID_UART
mattairtech_mt_d11.menu.com.cdc_midi_hid_uart.build.pid=0x0B34
# mattairtech_mt_d11.menu.com.cdc_msd_hid_uart=CDC_MSD_HID_UART
# mattairtech_mt_d11.menu.com.cdc_msd_hid_uart.build.board=CDC_MSD_HID_UART
# mattairtech_mt_d11.menu.com.cdc_msd_hid_uart.build.pid=0x0B40
# mattairtech_mt_d11.menu.com.cdc_msd_midi_hid_uart=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d11.menu.com.cdc_msd_midi_hid_uart.build.board=CDC_MSD_MIDI_HID_UART
# mattairtech_mt_d11.menu.com.cdc_msd_midi_hid_uart.build.pid=0x0B41
# mattairtech_mt_d11.menu.com.msd_uart=MSD_UART
# mattairtech_mt_d11.menu.com.msd_uart.build.board=MSD_UART
# mattairtech_mt_d11.menu.com.msd_uart.build.pid=0x0A0C
mattairtech_mt_d11.menu.com.uart=UART_ONLY
mattairtech_mt_d11.menu.com.uart.build.board=UART_ONLY
mattairtech_mt_d11.menu.com.uart.build.pid=0x0856
mattairtech_mt_d11.menu.com.none=USB_UART_DISABLED
mattairtech_mt_d11.menu.com.none.build.board=USB_UART_DISABLED
mattairtech_mt_d11.menu.com.none.build.pid=0x0856
mattairtech_mt_d11.build.core=arduino
mattairtech_mt_d11.build.variant=MT_D11
mattairtech_mt_d11.build.variant_system_lib=
mattairtech_mt_d11.build.vid=0x16D0
mattairtech_mt_d11.build.pid=0x0856
mattairtech_mt_d11.bootloader.tool=arduino:openocd
mattairtech_mt_d11.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD11D14AM.bin


